docs/cybersecurity.html
<!DOCTYPE html>
<html lang="en">
<head>
    <!-- 2020-10-04 dim. 15:15 -->
    <meta charset="utf-8">
    <meta name="viewport" content=
    "width=device-width, initial-scale=1">
    <title>Cybersecurity</title>
    <meta name="generator" content="Org mode">
    <link rel='stylesheet' type="text/css" href='org.css'>
</head>
<body>
    <div id="org-div-home-and-up">
        <!----> <a accesskey="H" href="index.html">Home</a>
    </div>
    <div id="content">
        <h1 class="title">Cybersecurity</h1>
        <div id="outline-container-org8a19540" class="outline-2">
            <h2 id="org8a19540">Web</h2>
            <div class="outline-text-2" id="text-org8a19540"></div>
            <div id="outline-container-org1f6ac92" class=
            "outline-3">
                <h3 id="org1f6ac92">Injection</h3>
                <div class="outline-text-3" id="text-org1f6ac92">
                </div>
                <div id="outline-container-org5cab07f" class=
                "outline-4">
                    <h4 id="org5cab07f">SQL Injection</h4>
                    <div class="outline-text-4" id=
                    "text-org5cab07f"></div>
                    <ul class="org-ul">
                        <li>
                            <a id="org7ef7af4"></a>List of location
                            for possible SQL Injection<br>
                            <div class="outline-text-5" id=
                            "text-org7ef7af4">
                                <p>There a several location for SQL
                                Injection.</p>
                            </div>
                            <ul class="org-ul">
                                <li>
                                    <a id=
                                    "org663844d"></a>Arguments in
                                    URLs<br>
                                    <div class="outline-text-6" id=
                                    "text-org663844d">
                                        <p>Arguments in URLs might
                                        be used to fetch
                                        informations from a
                                        database. If the SQL
                                        request is not filtered, it
                                        may be possible to exploit
                                        them. In the following url,
                                        the two arguments
                                        <code>action</code> and
                                        <code>news_id</code> might
                                        be injectable.</p>
                                        <pre class="example">
<code>http://example.com/?action=news&amp;news_id=12</code>
</pre>
                                        <p>For example, if
                                        <code>news_id</code> is
                                        injectable, this could be a
                                        valid payload :</p>
                                        <pre class="example">
<code>http://example.com/?action=news&amp;news_id=12 union select 1, 2, 3 from users;-- -</code>
</pre>
                                    </div>
                                </li>
                                <li>
                                    <a id=
                                    "orge14b434"></a>Forms<br>
                                </li>
                            </ul>
                        </li>
                        <li>
                            <a id="org2a2acdf"></a>Detect a SQL
                            Injection<br>
                        </li>
                        <li>
                            <a id="orga662cce"></a>Bypass using
                            GBK<br>
                            <div class="outline-text-5" id=
                            "text-orga662cce">
                                <p>GBK is a character encoding
                                format for chinese chars. If this
                                encoding is enabled, it is possible
                                to bypass php mysqsl
                                <code>addslashes</code>
                                filters.</p>
                                <p>Indeed, with this function every
                                single quote is escaped using an
                                anti-slash. But if we add
                                <code>%bf</code> before the simple
                                quote, the anti-slash is caught by
                                this caracter and the simple quote
                                become a valid character.</p>
                                <p>Example: <code>aaa' OR 1 = 1--
                                -</code> become <code>aaa\' OR 1 =
                                1-- -</code>; but <code>aaa%BF' OR
                                1 = 1-- -</code> become
                                <code>aaa%BF\' OR 1 = 1-- -</code>
                                and <code>%BF\</code> is one
                                character.</p>
                                <p>Reference: <a href=
                                "https://hydrasky.com/network-security/sql-injection-bypass-php-addslashs-function/">
                                https://hydrasky.com/network-security/sql-injection-bypass-php-addslashs-function/</a></p>
                            </div>
                        </li>
                    </ul>
                </div>
            </div>
            <div id="outline-container-org0757f18" class=
            "outline-3">
                <h3 id="org0757f18">File Inclusion</h3>
                <div class="outline-text-3" id="text-org0757f18">
                    <p>A File Inclusion is a type a vulnerability
                    where an attacker can read a file on the
                    server.</p>
                </div>
                <div id="outline-container-org0abff46" class=
                "outline-4">
                    <h4 id="org0abff46">Detect a File
                    Inclusion</h4>
                    <div class="outline-text-4" id=
                    "text-org0abff46">
                        <p>A famous location is in websites where
                        pages or languages are processed with urls
                        looking like this :</p>
                        <pre class="example">
<code>https://www.example.com/?lang=en</code>
<code>https://www.example.com/?page=home</code>
</pre>
                        <p>It is probable that in the backend, the
                        PHP code try to include files by appending
                        a <code>.php</code> extension.</p>
                        <p>To detect if these parameters are
                        vulnerables to file inclusion, add a null
                        byte <code>%00</code> at the end of the
                        arguments :</p>
                        <pre class="example">
<code>https://www.example.com/?lang=en%00</code>
<code>https://www.example.com/?page=home%00</code>
</pre>
                        <p>If the web site crash or if there is an
                        error message explaining that an include
                        failed, it is likely that the website is
                        vulnerable to file inclusion.</p>
                    </div>
                </div>
                <div id="outline-container-org522fe57" class=
                "outline-4">
                    <h4 id="org522fe57">PHP
                    Filters&nbsp;&nbsp;&nbsp;<span class=
                    "tag"><span class="PHP">PHP</span></span></h4>
                    <div class="outline-text-4" id=
                    "text-org522fe57">
                        <p>In an <code>include</code> statement,
                        PHP can process several filters. To use
                        them, the argument must begin with
                        <code>&lt;FILTER-TYPE&gt;://</code>.</p>
                        <p>With the <b>data</b> filter, it is
                        possible to include a string either
                        directly, or as a result of a php
                        function.</p>
                        <pre class="example">
<code>data://text/plain;base64,&lt;BASE64-ENCODED-STRING&gt;</code>
</pre>
                        <p>Example of payloads</p>
                        <table>
                            <colgroup>
                                <col class="org-left">
                                <col class="org-left">
                            </colgroup>
                            <thead>
                                <tr>
                                    <th scope="col" class=
                                    "org-left">Command</th>
                                    <th scope="col" class=
                                    "org-left">Base64</th>
                                </tr>
                            </thead>
                            <tbody>
                                <tr>
                                    <td class="org-left">&lt;?php
                                    phpinfo();?&gt;</td>
                                    <td class="org-left">
                                    data://text/plain;base64,PD9waHAgcGhwaW5mbygpOz8+</td>
                                </tr>
                                <tr>
                                    <td class="org-left">&lt;?php
                                    readfile(’index.php’);?&gt;</td>
                                    <td class="org-left">
                                    data://text/plain;base64,PD9waHAgcmVhZGZpbGUoJ2luZGV4LnBocCcpOz8+</td>
                                </tr>
                            </tbody>
                        </table>
                    </div>
                </div>
            </div>
            <div id="outline-container-orgae5408f" class=
            "outline-3">
                <h3 id="orgae5408f">Remote Code Execution</h3>
                <div class="outline-text-3" id="text-orgae5408f">
                </div>
                <div id="outline-container-org609b92c" class=
                "outline-4">
                    <h4 id="org609b92c">The
                    <code>preg_replace()</code>
                    function&nbsp;&nbsp;&nbsp;<span class=
                    "tag"><span class="PHP">PHP</span></span></h4>
                    <div class="outline-text-4" id=
                    "text-org609b92c">
                        <p>This function allows to execute PHP
                        code:</p>
                        <div class="org-src-container">
                            <pre class=
                            "src src-php"><code>preg_replace<span style=
                            "color: #51afef;">(</span><span style=
                            "color: #98be65;">"/string/e"</span>, <span style=
                            "color: #98be65;">"phpinfo();"</span>, <span style=
                            "color: #98be65;">"une string"</span><span style=
                            "color: #51afef;">)</span>;</code>
</pre>
                        </div>
                    </div>
                </div>
            </div>
            <div id="outline-container-orgedb9361" class=
            "outline-3">
                <h3 id="orgedb9361">Type Juggling</h3>
                <div class="outline-text-3" id="text-orgedb9361">
                </div>
                <div id="outline-container-org8c4f8a9" class=
                "outline-4">
                    <h4 id="org8c4f8a9">PHP</h4>
                    <div class="outline-text-4" id=
                    "text-org8c4f8a9">
                        <p>In PHP, <code>==</code> is a loose
                        comparison. For example :</p>
                        <div class="org-src-container">
                            <pre class=
                            "src src-php"><code>print_<span style=
                            "color: #51afef;">(</span><span style=
                            "color: #98be65;">"000"</span> == <span style=
                            "color: #ECBE7B;">int</span><span style=
                            "color: #c678dd;">(</span><span style=
                            "color: #da8548; font-weight: bold;">0</span><span style=
                            "color: #c678dd;">)</span><span style=
                            "color: #51afef;">)</span>; <span style=
                            "color: #5B6268;">// </span><span style=
                            "color: #5B6268;">TRUE</span></code>
<code>print_<span style="color: #51afef;">(</span><span style=
"color: #98be65;">"0e12"</span> == <span style=
"color: #ECBE7B;">int</span><span style=
"color: #c678dd;">(</span><span style=
"color: #da8548; font-weight: bold;">0</span><span style=
"color: #c678dd;">)</span><span style=
"color: #51afef;">)</span>; <span style=
"color: #5B6268;">// </span><span style=
"color: #5B6268;">TRUE</span></code>
<code>print_<span style="color: #51afef;">(</span><span style=
"color: #98be65;">"1abc"</span> == <span style=
"color: #ECBE7B;">int</span><span style=
"color: #c678dd;">(</span><span style=
"color: #da8548; font-weight: bold;">1</span><span style=
"color: #c678dd;">)</span><span style=
"color: #51afef;">)</span>; <span style=
"color: #5B6268;">// </span><span style=
"color: #5B6268;">TRUE</span></code>
<code>print_<span style="color: #51afef;">(</span><span style=
"color: #98be65;">"abc"</span> == <span style=
"color: #ECBE7B;">int</span><span style=
"color: #c678dd;">(</span><span style=
"color: #da8548; font-weight: bold;">0</span><span style=
"color: #c678dd;">)</span><span style=
"color: #51afef;">)</span>; <span style=
"color: #5B6268;">// </span><span style=
"color: #5B6268;">TRUE !! Any string is equal to int(0)</span></code>
</pre>
                        </div>
                        <p>The function <code>strcmp</code> can be
                        exploited too :</p>
                        <p>In the following example, we can use the
                        fact that comparing a string to an array
                        using the function <code>strcmp</code>
                        returns <code>NULL</code>.</p>
                        <div class="org-src-container">
                            <pre class=
                            "src src-php"><code>$<span style=
                            "color: #dcaeea;">user_input</span> = <span style=
                            "color: #51afef;">array</span><span style=
                            "color: #51afef;">()</span>;</code>
<code></code>
<code></code>
<code><span style="color: #51afef;">if</span> <span style=
"color: #51afef;">(</span>!strcmp<span style=
"color: #c678dd;">(</span>$<span style=
"color: #dcaeea;">user_input</span>, <span style=
"color: #98be65;">"Password"</span><span style=
"color: #c678dd;">)</span><span style=
"color: #51afef;">)</span> <span style=
"color: #51afef;">{</span></code>
<code>    <span style="color: #51afef;">echo</span> <span style=
"color: #98be65;">"Authenticated !"</span>;</code>
<code><span style="color: #51afef;">}</span></code>
</pre>
                        </div>
                    </div>
                </div>
            </div>
        </div>
        <div id="outline-container-orga08dc66" class="outline-2">
            <h2 id="orga08dc66">Tools</h2>
            <div class="outline-text-2" id="text-orga08dc66"></div>
            <div id="outline-container-org6fd44ab" class=
            "outline-3">
                <h3 id="org6fd44ab">Zaproxy</h3>
                <div class="outline-text-3" id="text-org6fd44ab">
                    <p>Zaproxy is a software developped by the
                    <b>OWASP</b> community. I allows the user to
                    intercept requests between the browser and the
                    server.</p>
                </div>
            </div>
            <div id="outline-container-org81b5551" class=
            "outline-3">
                <h3 id="org81b5551">Hacktricks</h3>
                <div class="outline-text-3" id="text-org81b5551">
                    <p><a href=
                    "https://book.hacktricks.xyz">https://book.hacktricks.xyz</a>
                    is a very usefull website full of ressources to
                    learn pentesting and priviledge escalation.</p>
                </div>
            </div>
        </div>
    </div>
</body>
</html>
